In [12]:
import cx_Oracle
import pandas as pd
db = cx_Oracle.connect("CABA_PDB","oracle","localhost:1521/xepdb1")
cursor = db.cursor()

In [18]:
cursor.execute('drop table ex1')
cursor.execute("create table ex1(id number,pwd number, name varchar2(20))")
# cursor.execute("insert into ex1(id,pwd,name)values(1,111,'kevin')")
# db.commit()

In [30]:
cursor.execute("select *from ex1")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("select column_name from user_tab_columns where table_name='EX1'")
col = cursor.fetchall()
list1 = []
for i in col:
    for j in i :
        list1.append(j)

df.columns = list1
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      100 non-null    int64
 1   PWD     100 non-null    int64
 2   NAME    100 non-null    object
dtypes: int64(2), object(1)
memory usage: 2.5+ KB

In [34]:
cursor.close()
db.commit()

In [33]:
cursor.execute('drop table ex1')
cursor.execute("create table ex1(id number,pwd number, name varchar2(20))")
for i in range(100):
     cursor.execute("insert into ex1(id,pwd,name)values(1,111,'kevin')")
    
# db.commit()
df

    ID  PWD   NAME
0    1  111  kevin
1    1  111  kevin
2    1  111  kevin
3    1  111  kevin
4    1  111  kevin
..  ..  ...    ...
95   1  111  kevin
96   1  111  kevin
97   1  111  kevin
98   1  111  kevin
99   1  111  kevin

[100 rows x 3 columns]